In [25]:
import pandas as pd
sw = pd.Series([20,30,40,50,60,70],index = ['mon','tue','wed','thurs','fri','sat'])
print(sw)
print("------------")
print(sw[['wed','fri']])

mon      20
tue      30
wed      40
thurs    50
fri      60
sat      70
dtype: int64
------------
wed    40
fri    60
dtype: int64

In [26]:
dic = {"Sindh":35000,"balouchistan":20000,"punjab":10000,"KPK":15000}
ser = pd.Series(dic, index = ["Sindh","balouchistan","punjab","KPK","gilgit"])
ser.fillna(25000)

Sindh           35000.0
balouchistan    20000.0
punjab          10000.0
KPK             15000.0
gilgit          25000.0
dtype: float64

In [40]:
apples = pd.Series([1,2,3,4,5])
oranges = pd.Series([6,7,8,9,10])
data = {"apples":apples,"oranges":oranges}
new_data = pd.DataFrame(data,index=['a','b','c','d','e'])
new_data

   apples  oranges
a     NaN      NaN
b     NaN      NaN
c     NaN      NaN
d     NaN      NaN
e     NaN      NaN

In [45]:
state = ['ohio','ohio','ohio','nevada','nevada','nevada']
data = {'state':state,
       'year': [2000,2001,2002,2001,2002,2003],
       'pop': [1.5,1.7,3.6,2.4,2.9,3.2]}
state_pop = pd.DataFrame(data,columns=['year','state','pop','debt'],
                       index = ['one','two','three','four','five','six'])
print(state_pop)
state_pop.fillna(123)

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  nevada  2.4  NaN
five   2002  nevada  2.9  NaN
six    2003  nevada  3.2  NaN

       year   state  pop  debt
one    2000    ohio  1.5   123
two    2001    ohio  1.7   123
three  2002    ohio  3.6   123
four   2001  nevada  2.4   123
five   2002  nevada  2.9   123
six    2003  nevada  3.2   123

In [46]:
import numpy as np
state = ['ohio','ohio','ohio','nevada','nevada','nevada']
data = {'state':state,
       'year': [2000,2001,2002,2001,2002,2003],
       'pop': [1.5,1.7,3.6,2.4,2.9,3.2]}
state_pop = pd.DataFrame(data,columns=['year','state','pop','debt'],
                       index = ['one','two','three','four','five','six'])
print(state_pop)
#state_pop.fillna(123)
l = len(state_pop)
f = np.arange(l)
state_pop['debt'] = f
state_pop

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  nevada  2.4  NaN
five   2002  nevada  2.9  NaN
six    2003  nevada  3.2  NaN

       year   state  pop  debt
one    2000    ohio  1.5     0
two    2001    ohio  1.7     1
three  2002    ohio  3.6     2
four   2001  nevada  2.4     3
five   2002  nevada  2.9     4
six    2003  nevada  3.2     5